In [16]:
import numpy as np
import pandas as pd
import warnings

In [17]:
warnings.filterwarnings('ignore')

## Get the Dataset

In [18]:
columns_name = ["user_id","item_id","rating","timestamp"]
df = pd.read_csv("ml-100k/u.data", sep = "\t", names=columns_name)

In [19]:
df.head()

   user_id  item_id  rating  timestamp
0      196      242       3  881250949
1      186      302       3  891717742
2       22      377       1  878887116
3      244       51       2  880606923
4      166      346       1  886397596

In [20]:
df.shape

(100000, 4)

In [21]:
# finding the unnique users
df["user_id"].nunique()

943

In [22]:
#finding unique movies
df["item_id"].nunique()

1682

In [23]:
movies_title = pd.read_csv("ml-100k/u.item",encoding = "ISO-8859-15", sep="\|", engine="python", header = None)

In [24]:
movies_title.shape

(1682, 24)

In [25]:
movies_title = movies_title[[0,1]]
movies_title.columns = ['item_id', 'title']

In [26]:
movies_title.head()

   item_id              title
0        1   Toy Story (1995)
1        2   GoldenEye (1995)
2        3  Four Rooms (1995)
3        4  Get Shorty (1995)
4        5     Copycat (1995)

In [28]:
#Merging two datafames
df  = pd.merge(df, movies_title, on="item_id")

In [30]:
df.tail()

,user_id,item_id,rating,timestamp,title
99995,840,1674,4,891211682,Mamma Roma (1962)
99996,655,1640,3,888474646,"Eighth Day, The (1996)"
99997,655,1637,3,888984255,Girls Town (1996)
99998,655,1630,3,887428735,"Silence of the Palace, The (Saimt el Qusur) (1..."
99999,655,1641,3,887427810,Dadetown (1995)

## Explaratory data analysis

In [34]:
import matplotlib.pyplot as plt
import seaborn as sns
sns.set_style("white")

In [39]:
df.groupby('title').mean()['rating'].sort_values(ascending=False)

title
They Made Me a Criminal (1939)                  5.0
Marlene Dietrich: Shadow and Light (1996)       5.0
Saint of Fort Washington, The (1993)            5.0
Someone Else's America (1995)                   5.0
Star Kid (1997)                                 5.0
                                               ...
Eye of Vichy, The (Oeil de Vichy, L') (1993)    1.0
King of New York (1990)                         1.0
Touki Bouki (Journey of the Hyena) (1973)       1.0
Bloody Child, The (1996)                        1.0
Crude Oasis, The (1995)                         1.0
Name: rating, Length: 1664, dtype: float64

In [41]:
ratings = pd.DataFrame(df.groupby('title').mean()['rating'])

In [43]:
ratings.head()

                             rating
title
'Til There Was You (1997)  2.333333
1-900 (1994)               2.600000
101 Dalmatians (1996)      2.908257
12 Angry Men (1957)        4.344000
187 (1997)                 3.024390

In [45]:
ratings['num_of_ratings'] = pd.DataFrame(df.groupby('title').count()['rating'])